var count = 3;
var check = 0;
var correct;
var count2 = 2;
var correct2;
var x = 5;

function moveShield(state) {
    const shield = document.getElementById('shield');
    const playerHeart = document.getElementById('player-heart');
    const positions = [
        { top: '70%', left: '40%' },
        { top: '40%', left: '50%' },
        { top: '70%', left: '60%' }
    ];

    if (state === 1) {
        shield.classList.add('morphed');
    } else {
        shield.classList.remove('morphed');
    }

    shield.style.top = positions[state].top;
    shield.style.left = positions[state].left;
    const dx = parseInt(shield.style.left) - parseInt(playerHeart.style.left);
    const dy = parseInt(shield.style.top) - parseInt(playerHeart.style.top);
    shield.style.transition = 'all 0.5s ease';
    shield.style.transform = `translate(-50%, -50%) translate(${dx}px, ${dy}px)`;
}

function moveup() {
    if (check == 0) {
        check = 1;
        count = 1;
    } else {
        count = (count + 1) % 3;
    }
    moveShield(count);
}

function movedown() {
    if (check == 0) {
        check = 1;
        count = 1;
    } else {
        count = count - 1;
    }
    if (count < 0) {
        count = 2;
    }
    moveShield(count);
}

function moveArrowIntoHeart() {
    checkshieldarrow();
    removetext();
    removeQuestion();
    const gameContainer = document.getElementById('game-container');
    const containerWidth = gameContainer.offsetWidth;
    const containerHeight = gameContainer.offsetHeight;
    const targetX = containerWidth * 0.5 - 5;
    const targetY = containerHeight * 0.7 - 5;
    moveElement(document.getElementById('left-arrow'), targetX, targetY);
    moveElement(document.getElementById('top-arrow'), targetX, targetY);
    moveElement(document.getElementById('right-arrow'), targetX, targetY);
    setTimeout(function() {
        toggleGameContainer();
    }, 1500);
}

function showarrow() {
    randomthree();
    arrowsVisible = true;
    document.querySelectorAll('.arrow').forEach(arrow => {
        arrow.style.display = 'block';
        arrow.style.opacity = '1';
    });
}

function hidearrow() {
    arrowsVisible = false;
    document.querySelectorAll('.arrow').forEach(arrow => {
        arrow.style.display = 'none';
    });
}

let originalPositions = {};

function moveElement(element, targetX, targetY) {
    const currentX = parseFloat(window.getComputedStyle(element).getPropertyValue('left'));
    const currentY = parseFloat(window.getComputedStyle(element).getPropertyValue('top'));

    if (!originalPositions[element.id]) {
        originalPositions[element.id] = { x: currentX, y: currentY };
    }

    let finalTargetX = targetX;
    let finalTargetY = targetY;

    if (correct === 1) {
        switch (bool) {
            case 0:
                finalTargetX = currentX + (targetX - currentX) * 0.5;
                finalTargetY = currentY + (targetY - currentY) * 0.5;
                break;
            case 1:
                finalTargetX = currentX + (targetX - currentX) * 0.5;
                finalTargetY = currentY + (targetY - currentY) * 0.5 - element.offsetHeight / 2;
                break;
            case 2:
                finalTargetX = currentX + (targetX - currentX) * 0.5 + element.offsetWidth / 2;
                finalTargetY = currentY + (targetY - currentY) * 0.5;
                break;
        }
    }


    const dx = finalTargetX - (currentX + element.offsetWidth / 2);
    const dy = finalTargetY - (currentY + element.offsetHeight / 2);

    element.style.transition = 'all 0.5s ease';
    element.style.transform = `translate(${dx}px, ${dy}px)`;
    const distanceToTarget = Math.sqrt(dx * dx + dy * dy);
    const timeToDisappear = 150;

    setTimeout(() => {
        if (distanceToTarget > 5) {
            if ((bool === 1 && element.id === 'top-arrow') ||
                (bool === 0 && element.id === 'left-arrow') ||
                (bool === 2 && element.id === 'right-arrow')) {
                element.style.display = 'block';
                setTimeout(() => {
                    element.style.opacity = '0';
                    setTimeout(() => {
                        moveElementBack(element, finalTargetX, finalTargetY);
                    }, 250);
                }, 800);
            } else {
                element.style.opacity = '0';
                setTimeout(() => {
                    moveElementBack(element, finalTargetX, finalTargetY);
                }, 300);
            }
        } else {
            element.style.display = 'block';
            element.style.opacity = '0';
            moveElementBack(element, finalTargetX, finalTargetY);
        }
    }, timeToDisappear - 50);
}

function checkshieldarrow() {
    if (count == bool) {
        correct = 1;
    } else {
        correct = 0;
        playSoundForDuration();
        setTimeout(() => {
            playerdelhealth(x);

        }, 200);
    }
}

function checktruefalse() {
    if (count2 == bool2) {
        correct2 = 1;
    } else {
        correct2 = 0;
        playSoundForDuration();
        setTimeout(() => {
            playerdelhealth(x);

        }, 200);
    }
}

function moveElementBack(element) {
    const originalX = originalPositions[element.id].x;
    const originalY = originalPositions[element.id].y;

    const currentX = parseFloat(window.getComputedStyle(element).getPropertyValue('left'));
    const currentY = parseFloat(window.getComputedStyle(element).getPropertyValue('top'));

    const offsetX = originalX - currentX;
    const offsetY = originalY - currentY;

    element.style.transition = 'all 0.5s ease';
    element.style.transform = `translate(${offsetX}px, ${offsetY}px)`;
    element.style.opacity = '0';
}

function removetext() {
    textboxValues = ['', '', ''];

    document.getElementById('display-area1').innerHTML = '';
    document.getElementById('display-area2').innerHTML = '';
    document.getElementById('display-area3').innerHTML = '';
}

function displayAddedText() {
    const displayArea1 = document.getElementById('display-area1');
    const displayArea2 = document.getElementById('display-area2');
    const displayArea3 = document.getElementById('display-area3');

    displayArea1.innerHTML = '';
    displayArea2.innerHTML = '';
    displayArea3.innerHTML = '';

    displayArea1.textContent = textboxValues1;
    displayArea2.textContent = textboxValues2;
    displayArea3.textContent = textboxValues3;
}

function toggleGameContainer() {
    const gameContainer = document.getElementById('game-container');
    const moveLeftButton = document.getElementById('moveleft');
    const moveRightButton = document.getElementById('moveright');
    const questionBox = document.getElementById('question-box');

    const isVisible = gameContainer.classList.contains('visible');

    if (isVisible) {
        let opacity = 1;
        let height = 30;
        const interval = 10;
        const steps = 30;
        moveLeftButton.style.display = 'none';
        moveRightButton.style.display = 'none';
        questionBox.style.display = 'none';
        const decreaseHeight = () => {
            height -= 30 / steps;
            if (height <= 0) {
                height = 0;
                clearInterval(timer);
                gameContainer.style.display = 'none';
                gameContainer.classList.remove('visible');
                gameContainer.classList.add('invisible');

            }
            gameContainer.style.height = height + '%';
        };

        const fadeOut = () => {
            opacity -= 1 / steps;
            if (opacity <= 0) {
                opacity = 0;
                clearInterval(timer);
            }
            gameContainer.style.opacity = opacity;
        };

        const timer = setInterval(() => {
            decreaseHeight();
            fadeOut();
        }, interval);
    } else {
        let opacity = 0;
        let height = 0;
        const interval = 10;
        const steps = 30;

        gameContainer.style.display = 'block';

        const increaseHeight = () => {
            height += 30 / steps;
            if (height >= 30) {
                height = 30;
                clearInterval(timer);
                gameContainer.classList.remove('invisible');
                gameContainer.classList.add('visible');
                moveLeftButton.style.display = 'block';
                moveRightButton.style.display = 'block';
                questionBox.style.display = 'block';
            }
            gameContainer.style.height = height + '%';
        };

        const fadeIn = () => {
            opacity += 1 / steps;
            if (opacity >= 1) {
                opacity = 1;
                clearInterval(timer);
            }
            gameContainer.style.opacity = opacity;
        };

        const timer = setInterval(() => {
            increaseHeight();
            fadeIn();
        }, interval);
    }
}

function playSoundForDuration() {
    var sound = document.getElementById("sound");
    sound.play();
    setTimeout(function() {
        sound.pause();
        sound.currentTime = 0;
    }, 1000);
}

function displayQuestion() {
    const questionTextElement = document.getElementById('question-text');
    questionTextElement.textContent = Question;
}

function removeQuestion() {
    const questionTextElement = document.getElementById('question-text');
    questionTextElement.textContent = ' ';
}

function toggleattackContainer() {
    const gameContainer = document.getElementById('play-attack');
    const isVisible = gameContainer.classList.contains('visible');
    var myButtonheal = document.getElementById('playerheal');
    var myButtonattack = document.getElementById('playerattack');
    myButtonattack.disabled = false;
    myButtonheal.disabled = false;
    if (isVisible) {
        let opacity = 1;
        let height = 30;
        const interval = 10;
        const steps = 30;

        const decreaseHeight = () => {
            height -= 30 / steps;
            if (height <= 0) {
                height = 0;
                clearInterval(timer);
                gameContainer.style.display = 'none';
                gameContainer.classList.remove('visible');
                gameContainer.classList.add('invisible');
            }
            gameContainer.style.height = height + '%';
        };

        const fadeOut = () => {
            opacity -= 1 / steps;
            if (opacity <= 0) {
                opacity = 0;
                clearInterval(timer);
            }
            gameContainer.style.opacity = opacity;
        };

        const timer = setInterval(() => {
            decreaseHeight();
            fadeOut();
        }, interval);
    } else {
        let opacity = 0;
        let height = 0;
        const interval = 10;
        const steps = 30;

        gameContainer.style.display = 'block';

        const increaseHeight = () => {
            height += 30 / steps;
            if (height >= 30) {
                height = 30;
                clearInterval(timer);
                gameContainer.classList.remove('invisible');
                gameContainer.classList.add('visible');
            }
            gameContainer.style.height = height + '%';
        };

        const fadeIn = () => {
            opacity += 1 / steps;
            if (opacity >= 1) {
                opacity = 1;
                clearInterval(timer);
            }
            gameContainer.style.opacity = opacity;
        };

        const timer = setInterval(() => {
            increaseHeight();
            fadeIn();
        }, interval);
    }
}

function playerattack() {
    var myButtonattack = document.getElementById('playerattack');
    var myButtonheal = document.getElementById('playerheal');
    toggleattackContainer();
    startslash();
    myButtonattack.disabled = true;
    myButtonheal.disabled = true;
    setTimeout(() => {
        bossdelhealth(10);
    }, 200);
}

function playerheal() {
    var myButtonheal = document.getElementById('playerheal');
    var myButtonattack = document.getElementById('playerattack');
    toggleattackContainer();
    myButtonattack.disabled = true;
    myButtonheal.disabled = true;
    setTimeout(() => {
        playerHealAnimation(10);
    }, 200);
}

function startheal() {
    var healElement = document.getElementById("heal");
    healElement.innerHTML = "";
    for (let i = 0; i < 50; i++) {
        var dot = document.createElement("div");
        dot.classList.add("dot");
        dot.style.left = Math.random() * 150 + "px";
        dot.style.top = Math.random() * 150 + "px";
        var duration = Math.random() * 2 + 0.5;
        dot.style.animation = "moveDot " + duration + "s linear forwards";
        healElement.appendChild(dot);
    }
}

function startslash() {
    const slash = document.querySelector('#slash');
    slash.style.animation = 'none';
    void slash.offsetWidth;
    slash.style.animation = null;
    slash.style.display = 'block';
    slash.addEventListener('animationend', function() {
        setTimeout(function() {
            slash.style.display = 'none';
        }, 500);
    });
}

var bool;
var Question = ' ';
var textboxValues1;
var textboxValues2;
var textboxValues3;
var bool2;


var data2 = [
    [
        ["เครื่องมือวัดไมโครมิเตอร์เหมาะกับการใช้วัดความยาวของแครอทมากกว่าเวอร์เนียคาลิปเปอร์", "0"],
        ["เวอร์เนียคาลิปเปอร์เป็นเครื่องมือวัดอย่างละเอียด", "1"],
        ["หลักการอ่านค่าของเวอร์เนียคาลิปเปอร์ ต้องอ่านทั้งสเกลหลักและสเกลรอง", "1"],
        ["ตัวเลขที่อ่านได้จากสเกลรองของเวอร์เนียคาลิปเปอร์ คือค่าความน่าเชื่อถือของการวัด", "0"],
        ["ตัวเลขที่อ่านได้จากสเกลรองของเวอร์เนียคาลิปเปอร์ คือค่าความละเอียดของการวัด", "1"],
        ["เครื่องมือวัดไมโครมิเตอร์เหมาะกับการใช้วัดความหนาของใบผักมากกว่าเวอร์เนียคาลิปเปอร์", "1"],
        ["การอ่านค่าสเกลหลักของไมโครมิเตอร์เพียงพอต่อการบันทึกข้อมูลของการวัดอย่างละเอียด", "0"],
        ["ไมโครมิเตอร์วัดระยะได้โดยการเปลี่ยนระยะไปเป็นรอบหมุน", "1"],
        ["เวอร์เนียคาลิปเปอร์วัดระยะได้โดยการเปลี่ยนระยะไปเป็นรอบหมุน", "0"],
        ["นักผจญภัยใช้ไมโครมิเตอร์วัดขนาดของมะเขือเทศได้ 11.11 มิลลิเมตร ความละเอียดของไมโครมิเตอร์มีค่าเท่ากับ 0.02 มิลลิเมตร", "0"],
        ["นักผจญภัยใช้ไมโครมิเตอร์วัดขนาดของมะเขือเทศลูกหนึ่งและบันทึกค่าที่วัดได้เป็น 11.11 มิลลิเมตร นักผจญภัยบันทึกข้อมูลถูกต้องตามหลักการวัดหรือไม่", "1"],
        ["นักผจญภัยใช้เวอร์เนียคาลิปเปอร์ที่มีค่าความละเอียด 0.02 มิลลิเมตร วัดความยาวของผักกาดขาวต้นหนึ่งและบันทึกค่าที่วัดได้เป็น 11.11 มิลลิเมตร นักผจญภัยบันทึกข้อมูลถูกต้องตามหลักการวัดหรือไม่", "0"],
        ["นักผจญภัยใช้เวอร์เนียคาลิปเปอร์ที่มีค่าความละเอียด 0.02 มิลลิเมตร วัดความยาวของผักกาดขาวต้นหนึ่งและบันทึกค่าที่วัดได้เป็น 11.12 มิลลิเมตร นักผจญภัยบันทึกข้อมูลถูกต้องตามหลักการวัดหรือไม่", "1"],
        ["นักผจญภัยใช้เวอร์เนียคาลิปเปอร์ที่มีค่าความละเอียด 0.02 มิลลิเมตร วัดความยาวของผักกาดขาวต้นหนึ่งและบันทึกค่าที่วัดได้เป็น 11.15 มิลลิเมตร นักผจญภัยบันทึกข้อมูลถูกต้องตามหลักการวัดหรือไม่", "0"],
        ["นักผจญภัยใช้เวอร์เนียคาลิปเปอร์ที่มีค่าความละเอียด 0.02 มิลลิเมตร วัดความยาวของผักกาดขาวต้นหนึ่งและบันทึกค่าที่วัดได้เป็น 11.20 มิลลิเมตร นักผจญภัยบันทึกข้อมูลถูกต้องตามหลักการวัดหรือไม่", "1"],
        ["นักผจญภัยใช้เวอร์เนียคาลิปเปอร์ที่มีค่าความละเอียด 0.05 มิลลิเมตร วัดความยาวของผักกาดขาวต้นหนึ่งและบันทึกค่าที่วัดได้เป็น 11.15 มิลลิเมตร นักผจญภัยบันทึกข้อมูลถูกต้องตามหลักการวัดหรือไม่", "1"],
        ["นักผจญภัยใช้เวอร์เนียคาลิปเปอร์ที่มีค่าความละเอียด 0.05 มิลลิเมตร วัดความยาวของผักกาดขาวต้นหนึ่งและบันทึกค่าที่วัดได้เป็น 11.10 มิลลิเมตร นักผจญภัยบันทึกข้อมูลถูกต้องตามหลักการวัดหรือไม่", "1"],
        ["นักผจญภัยใช้เวอร์เนียคาลิปเปอร์ที่มีค่าความละเอียด 0.05 มิลลิเมตร วัดความยาวของแครอทและบันทึกค่าที่วัดได้เป็น 20.20 มิลลิเมตร นักผจญภัยบันทึกข้อมูลถูกต้องตามหลักการวัดหรือไม่", "1"],
        ["นักผจญภัยใช้เวอร์เนียคาลิปเปอร์ที่มีค่าความละเอียด 0.05 มิลลิเมตร วัดความยาวของแครอทและบันทึกค่าที่วัดได้เป็น 20.21 มิลลิเมตร นักผจญภัยบันทึกข้อมูลถูกต้องตามหลักการวัดหรือไม่", "0"],
        ["นักผจญภัยใช้เวอร์เนียคาลิปเปอร์ที่มีค่าความละเอียด 0.05 มิลลิเมตร วัดความยาวของแครอทและบันทึกค่าที่วัดได้เป็น 20.22 มิลลิเมตร นักผจญภัยบันทึกข้อมูลถูกต้องตามหลักการวัดหรือไม่", "0"],
        ["นักผจญภัยใช้เวอร์เนียคาลิปเปอร์ที่มีค่าความละเอียด 0.05 มิลลิเมตร วัดความยาวของแครอทและบันทึกค่าที่วัดได้เป็น 20.30 มิลลิเมตร นักผจญภัยบันทึกข้อมูลถูกต้องตามหลักการวัดหรือไม่", "1"],
        ["นักผจญภัยใช้เวอร์เนียร์คาลิปเปอร์อันหนึ่ง วัดขนาดของมะเขือเทศ ได้ 11.10 มิลลิเมตร ความละเอียดของไมโครมิเตอร์มีค่าเท่ากับ 0.02 มิลลิเมตร", "1"],
        ["นักผจญภัยใช้เวอร์เนียร์คาลิปเปอร์อันหนึ่ง วัดขนาดของมะเขือเทศ ได้ 11.15 มิลลิเมตร ความละเอียดของไมโครมิเตอร์มีค่าเท่ากับ 0.02 มิลลิเมตร", "0"],
        ["นักผจญภัยใช้เวอร์เนียร์คาลิปเปอร์อันหนึ่ง วัดขนาดของมะเขือเทศ ได้ 11.16 มิลลิเมตร ความละเอียดของไมโครมิเตอร์มีค่าเท่ากับ 0.02 มิลลิเมตร", "1"],
        ["นักผจญภัยใช้เวอร์เนียร์คาลิปเปอร์อันหนึ่ง วัดขนาดของมะเขือเทศ ได้ 11.17 มิลลิเมตร ความละเอียดของไมโครมิเตอร์มีค่าเท่ากับ 0.02 มิลลิเมตร", "0"]
    ],
    [
        ["มวล เวลา และความยาว เป็นปริมาณฐานทั้งหมด", "1"],
        ["น้ำหนัก อุณหภูมิอุณหพลวัต และกระแสไฟฟ้า เป็นปริมาณฐานทั้งหมด", "0"],
        ["เวลา ปริมาณสาร และความเข้มของการส่องสว่าง เป็นปริมาณฐานทั้งหมด", "1"],
        ["กิโลกรัม วินาที และเมตร เป็นหน่วยฐานทั้งหมด", "1"],
        ["นิวตัน เคลวิน และแอมแปร์ เป็นหน่วยฐานทั้งหมด", "0"],
        ["วินาที โมล และแคนเดลา เป็นหน่วยฐานทั้งหมด", "1"],
        ["กิโลกรัม (kg) เป็นหน่วยฐานของมวล", "1"],
        ["กิโลกรัม (kg) เป็นหน่วยฐานของน้ำหนัก", "0"],
        ["กรัม (g) เป็นหน่วยฐานของมวล", "0"],
        ["วินาที (s) เป็นหน่วยฐานของเวลา", "1"],
        ["นาที (min) เป็นหน่วยฐานของเวลา", "0"],
        ["ชั่วโมง (hr) เป็นหน่วยฐานของเวลา", "0"],
        ["เมตร (m) เป็นหน่วยฐานของความยาว", "1"],
        ["กิโลเมตร (km) เป็นหน่วยฐานของความยาว", "0"],
        ["เคลวิน (K) เป็นหน่วยฐานของอุณหภูมิอุณหพลวัต", "1"],
        ["องศาเซลเซียส (°C) เป็นหน่วยฐานของอุณหภูมิอุณหพลวัต", "0"],
        ["องศาฟาเรนไฮต์ (°F) เป็นหน่วยฐานของอุณหภูมิอุณหพลวัต", "0"],
        ["แอมแปร์ (A) เป็นหน่วยฐานของกระแสไฟฟ้า", "1"],
        ["โวลต์ (V) เป็นหน่วยฐานของกระแสไฟฟ้า", "0"],
        ["โมล (mol) เป็นหน่วยฐานของปริมาณสาร", "1"],
        ["กิโลกรัม (kg) เป็นหน่วยฐานของปริมาณสาร", "0"],
        ["แคนเดลา (cd) เป็นหน่วยฐานของความเข้มของการส่องสว่าง", "1"],
        ["ลูเมน (lm) เป็นหน่วยฐานของความเข้มของการส่องสว่าง", "0"],
        ["ลักซ์ (lx) เป็นหน่วยฐานของความเข้มของการส่องสว่าง", "0"],
        ["วัตต์ (W) เป็นหน่วยฐานของกระเแสไฟฟ้า", "0"]
    ],
    [
        ["ตัวพหุคูณ 10⁻³ ใช้แทนคำอุปสรรค k", "0"],
        ["ตัวพหุคูณ 10⁻³ ใช้แทนคำอุปสรรค m", "1"],
        ["ตัวพหุคูณ 10⁻¹ ใช้แทนคำอุปสรรค d", "1"],
        ["ตัวพหุคูณ 10⁻¹ ใช้แทนคำอุปสรรค c", "0"],
        ["ตัวพหุคูณ 10¹ ใช้แทนคำอุปสรรค da", "1"],
        ["ตัวพหุคูณ 10¹ ใช้แทนคำอุปสรรค n", "0"],
        ["ตัวพหุคูณ 10¹² ใช้แทนคำอุปสรรค T", "1"],
        ["ตัวพหุคูณ 10¹² ใช้แทนคำอุปสรรค P", "0"],
        ["นักผจญวัดความหนาของใบผักได้ 2.65 เซนติเมตร สามารถบันทึกตัวเลขได้เป็น 265 มิลลิเมตร", "0"],
        ["นักผจญวัดขนาดของมะเขือเทศได้ 4.60 เซนติเมตร สามารถบันทึกตัวเลขได้เป็น 46.0 มิลลิเมตร", "1"],
        ["ชาวบ้านแนะนำให้นักผจญภัยปลูกผักกาดขาวแต่ละต้นห่างกันเป็นระยะ 50.55 มิลลิเมตร นั่นหมายความว่านักผจญภัยต้องโรยเมล็ดผักกาดขาวห่างกันเป็นระยะ 5.055 เซนติเมตร", "1"],
        ["นักผจญภัยวัดอุณหภูมิของหลอดไฟได้ 6.5 x 10⁻⁶ เคลวิน สามารถบันทึกค่าอุณหภูมิได้เป็น 6.5 นาโนเคลวิน", "0"],
        ["นักผจญภัยวัดอุณหภูมิของหลอดไฟได้ 3.55 x 10⁻³ เคลวิน สามารถบันทึกค่าอุณหภูมิได้เป็น 3.55 มิลลิเคลวิน", "1"],
        ["นักผจญภัยวัดกระแสไฟฟ้าที่ไหลผ่านหลอดไฟหลอดหนึ่งได้ 0.086 แอมแปร์ สามารถบันทึกค่ากระแสไฟฟ้าที่ไหลผ่านหลอดไฟได้เป็น 86 มิลลิแอมแปร์", "1"],
        ["นักผจญภัยวัดกระแสไฟฟ้าที่ไหลผ่านหลอดไฟหลอดหนึ่งได้ 9.56 ไมโครแอมแปร์ สามารถบันทึกค่ากระแสไฟฟ้าที่ไหลผ่านหลอดไฟได้เป็น  9.56 10⁻⁶ แอมแปร์", "1"],
        ["สัญลักษณ์ของคำอุปสรรค นาโน(nano) คือ N", "0"],
        ["สัญลักษณ์ของคำอุปสรรค พิโค(pico) คือ pi", "0"],
        ["สัญลักษณ์ของคำอุปสรรค กิโล(kilo) คือ K", "0"],
        ["สัญลักษณ์ของคำอุปสรรค เมกะ(mega) คือ M", "1"],
        ["สัญลักษณ์ของคำอุปสรรค เซนติ(centi) คือ c", "1"],
        ["สัญลักษณ์ของคำอุปสรรค เดซิ(deci) คือ d", "1"],
        ["สัญลักษณ์ของคำอุปสรรค มิลลิ(milli) คือ mi", "0"],
        ["สัญลักษณ์ของคำอุปสรรค จิกะ (giga) คือ G", "1"],
        ["สัญลักษณ์ของคำอุปสรรค เทระ(tera) คือ T", "1"],
        ["สัญลักษณ์ของคำอุปสรรค เดคา(deca) คือ de", "0"]
    ],
    [
        ["เลขนัยสำคัญ คือปริมาณที่ได้จากการวัดและการทดลอง", "1"],
        ["ทะเบียนรถ จัดเป็นเลขนัยสำคัญ", "0"],
        ["หมายเลขบัตรประชาชน จัดเป็นเลขนัยสำคัญ", "0"],
        ["ค่าคงตัวของ π จัดเป็นเลขนัยสำคัญ", "0"],
        ["ค่าที่อ่านได้จากเวอร์เนียคาลิปเปอร์ จัดเป็นเลขนัยสำคัญ", "1"],
        ["ค่าที่อ่านได้จากเวอร์เนียคาลิปเปอร์ จัดเป็นเลขนัยสำคัญ", "1"],
        ["2πr มีเลขนัยสำคัญ 1 ตัว", "0"],
        ["0.00501 มีเลขนัยสำคัญ 3 ตัว", "1"],
        ["0.082 มีเลขนัยสำคัญ 4 ตัว", "0"],
        ["25.607 มีเลขนัยสำคัญ 5 ตัว", "1"],
        ["40.080 มีเลขนัยสำคัญ 2 ตัว", "0"],
        ["0.00001 มีเลขนัยสำคัญ 1 ตัว", "1"],
        ["1.908 x 10² มีเลขนัยสำคัญ 4 ตัว", "1"],
        ["9.040 x 10⁻³ มีเลขนัยสำคัญ 2 ตัว", "0"],
        ["5.0001 x 10⁻² มีเลขนัยสำคัญ 5 ตัว", "1"],
        ["7,900 มีเลขนัยสำคัญ 4 ตัว", "1"],
        ["0.0004873 มีเลขนัยสำคัญ 7 ตัว", "0"],
        ["70.0040560 มีเลขนัยสำคัญ 9 ตัว", "1"],
        ["6.0410 มีเลขนัยสำคัญ 3 ตัว", "0"],
        ["0.0040 มีเลขนัยสำคัญ 2 ตัว", "1"],
        ["9.002 x 10⁶ มีเลขนัยสำคัญ 2 ตัว", "0"],
        ["0.0123 มีเลขนัยสำคัญ 3 ตัว", "1"],
        ["65.0014 มีเลขนัยสำคัญ 6 ตัว", "1"],
        ["18.00 มีเลขนัยสำคัญ 2 ตัว", "0"],
        ["17.1000 มีเลขนัยสำคัญ 6 ตัว", "1"]
    ],
    [
        ["มวลของแครอท จัดเป็นปริมาณเวกเตอร์", "0"],
        ["เวลาที่ใช้ในการแช่ผัก จัดเป็นปริมาณเวกเตอร์", "0"],
        ["นักผจญภัยวิ่งไล่จับแครอทพันปีรอบหมู่บ้านเป็นระยะทาง 1.45 กิโลเมตร จากข้อความข้างต้นระยะทางจัดเป็นปริมาณเวกเตอร์", "0"],
        ["พื้นที่สวนแครอท จัดเป็นปริมาณเวกเตอร์", "0"],
        ["น้ำหนักของมะเขือเทศ จัดเป็นปริมาณเวกเตอร์", "1"],
        ["บริเวณทิศเหนือของหมู่บ้านมีลมตะวันตกเฉียงใต้พัดผ่านด้วยความเร็ว 10-20 กิโลเมตรต่อชั่วโมง จากข้อความข้างต้นมีข้อมูลที่แสดงถึงปริมาณเวกเตอร์", "1"],
        ["ระยะที่ลากเส้นตรงจากจุดเริ่มต้นไปจุดสุดท้ายพร้อมกับแสดงทิศทางบนแผนที่ จัดเป็นปริมาณสเกลาร์", "0"],
        ["ปริมาตรของน้ำที่ใช้ในการแช่ผัก จัดเป็นปริมาณเวกเตอร์", "0"],
        ["นักผจญภัยวัดกระแสไฟฟ้าที่ใช้ในหลอดไฟ 1 หลอดได้ 0.125 แอมแปร์ ค่าที่วัดได้จัดเป็นปริมาณสเกลาร์", "1"],
        ["นักผจญภัยวัดอุณหภูมิของหลอดไฟได้ 6.500 x 10³ เคลวิน ค่าที่วัดได้จัดเป็นปริมาณเวกเตอร์", "0"],
        ["นักผจญภัยวัดความยาวของมะเขือยาวได้ 7.100 เซนติเมตร ค่าที่วัดได้จัดปริมาณเวกเตอร์", "0"],
        ["นักผจญวัดขนาดของมะเขือเทศได้ 4.60 เซนติเมตร ค่าที่วัดได้จัดปริมาณสเกลาร์", "1"],
        ["ส่วนสูงของนักผจญภัย จัดเป็นปริมาณเวกเตอร์", "0"],
        ["ความสูงของต้นไม้ จัดเป็นปริมาณเวกเตอร์", "1"],
        ["นักผจญภัยออกแรงขนาด 10 นิวตัน ลากรถเข็นแครอทขนาด 150 กิโลกรัม เพื่อนำไปขายที่ร้านค้า จากข้อความข้างต้นแรงและขนาดของรถเข็นจัดเป็นปริมาณเวกเตอร์", "0"],
        ["บริเวณทิศเหนือของหมู่บ้านมีลมพัดผ่านด้วยความเร็วขนาด 20 กิโลเมตรต่อชั่วโมง จากข้อความข้างต้นมีข้อมูลที่แสดงถึงปริมาณเวกเตอร์", "0"],
        ["เวกเตอร์ที่ี่ตรงข้ามกันจะมีขนาดและทิศต่างแตกต่างกันเสมอ", "0"],
        ["เวกเตอร์ที่ตรงข้ามกันจะมีทิศทางแตกต่างกันเสมอ", "1"],
        ["เวกเตอร์ที่ตรงข้ามกันจะมีขนาดเท่ากัน แต่ทิศทางตรงข้ามกัน", "1"]
    ]
];


var data = [
    [
        ["เครื่องมือวัดชนิดใดเหมาะกับการวัดความหนาของใบผักมากที่สุด", "ไมโครมิเตอร์", "เวอร์เนียคาลิปเปอร์", "ฟุตเหล็ก"],
        ["หากต้องการวัดอย่างละเอียด เครื่องมือวัดชนิดใดเหมาะกับการวัดความยาวของมะเขือยาวมากที่สุด", "เวอร์เนียคาลิปเปอร์", "ไมโครมิเตอร์", "ฟุตเหล็ก"],
        ["หากต้องการวัดอย่างละเอียด เครื่องมือวัดชนิดใดเหมาะกับการวัดความยาวของแครอทมากที่สุด", "เวอร์เนียคาลิปเปอร์", "ไมโครมิเตอร์", "ฟุตเหล็ก"],
        ["หากต้องการวัดอย่างละเอียด เครื่องมือวัดชนิดใดเหมาะกับการวัดความหนาของแผ่นไม้มากที่สุด", "ไมโครมิเตอร์", "เวอร์เนียคาลิปเปอร์", "ฟุตเหล็ก"],
        ["หากต้องการวัดอย่างละเอียด เครื่องมือวัดชนิดใดเหมาะกับการวัดเส้นผ่านศูนย์กลางของหลอดไฟมากที่สุด", "ไมโครมิเตอร์", "เวอร์เนียคาลิปเปอร์", "ฟุตเหล็ก"],
        ["สเกลบนปลอกหมุนวัดของไมโครมิเตอร์แต่ละขีดมีค่าเท่าไร", "0.01 มิลลิเมตร", "0.02 มิลลิเมตร", "0.03 มิลลิเมตร"],
        ["เครื่องมือวัดชนิดใดเหมาะกับการวัดเส้นผ่านศูนย์กลางของมะเขือเทศมากที่สุด", "เวอร์เนียคาลิปเปอร์", "ไมโครมิเตอร์", "ฟุตเหล็ก"],
        ["เครื่องมือวัดชนิดใดเหมาะกับการวัดความหนาของเหรียญมากที่สุด", "ไมโครมิเตอร์", "เวอร์เนียคาลิปเปอร์", "ฟุตเหล็ก"],
        ["เครื่องมือวัดชนิดใดเหมาะกับการวัดความสูงของต้นกล้าผักมากที่สุด", "เวอร์เนียคาลิปเปอร์", "ไมโครมิเตอร์", "เลเซอร์วัดระยะ"],
        ["หากใช้เวอร์เนียคาลิปเปอร์ที่มีค่าความละเอียด 0.02 มิลลิเมตร วัดความลึกของหลุมปลูกผักควรบันทึกค่าที่วัดได้ตามข้อใด", "60.50 มิลลิเมตร", "60.51 มิลลิเมตร", "60.53 มิลลิเมตร"],
        ["หากใช้เวอร์เนียคาลิปเปอร์ที่มีค่าความละเอียด 0.05 มิลลิเมตร วัดความลึกของหลุมปลูกผักควรบันทึกค่าที่วัดได้ตามข้อใด", "60.55 มิลลิเมตร", "60.56 มิลลิเมตร", "60.57 มิลลิเมตร"],
        ["หากใช้ไมโครมิเตอร์วัดความหนาของใบผัก ค่าที่วัดได้ควรบันทึกทศนิยมกี่ตำแหน่ง", "2 ตำแหน่ง", "1 ตำแหน่ง", "3 ตำแหน่ง"],
        ["หากใช้ไมโครมิเตอร์วัดความหนาของขอบโต๊ะ ค่าที่วัดได้ควรบันทึกทศนิยมกี่ตำแหน่ง", "3 ตำแหน่ง", "4 ตำแหน่ง", "5 ตำแหน่ง"],
        ["หากใช้ไมโครมิเตอร์วัดความหนาของเหรียญ ค่าที่วัดได้ควรบันทึกทศนิยมกี่ตำแหน่ง", "3 ตำแหน่ง", "4 ตำแหน่ง", "5 ตำแหน่ง"],
        ["หากใช้ไมโครมิเตอร์วัดความหนาของเหรียญ ควรบันทึกค่าที่วัดได้ตามข้อใด", "5.235 มิลลิเมตร", "5.23 มิลลิเมตร", "5.2345 มิลลิเมตร"],
        ["หากใช้ไมโครมิเตอร์วัดความหนาของขอบโต๊ะ ควรบันทึกค่าที่วัดได้ตามข้อใด", "20.235 มิลลิเมตร", "20.23 มิลลิเมตร", "20.2345 มิลลิเมตร"],
        ["หากใช้ไมโครมิเตอร์วัดขนาดของมะเขือเทศ ควรบันทึกค่าที่วัดได้ตามข้อใด", "10.23 มิลลิเมตร", "10.235 มิลลิเมตร", "10.2345 มิลลิเมตร"],
        ["หากใช้ไมโครมิเตอร์วัดความหนาของใบไม้ ควรบันทึกค่าที่วัดได้ตามข้อใด", "1.23 มิลลิเมตร", "1.235 มิลลิเมตร", "1.2345 มิลลิเมตร"],
        ["หากใช้ไมโครมิเตอร์วัดความหนาของขอบประตูบ้าน ควรบันทึกค่าที่วัดได้ตามข้อใด", "60.235 มิลลิเมตร", "60.23 มิลลิเมตร", "60.2345 มิลลิเมตร"],
        ["ไมโครมิเตอร์สามารถนำไปใช้ในการวัดต่อไปนี้ ยกเว้นข้อใด", "วัดเส้นผ่านศูนย์กลางของหลุมปลูกผัก", "วัดเส้นผ่านศูนย์กลางของมะเขือเทศ", "วัดเส้นผ่านศูนย์กลางของเหรียญ"],
        ["ไมโครมิเตอร์สามารถนำไปใช้ในการวัดต่อไปนี้ ยกเว้นข้อใด", "ความหนาของเสาไม้", "ความหนาของเส้นผม", "ความหนาของกระดาษ"],
        ["เวอร์เนียคาลิปเปอร์เป็นเครื่องมือวัดละเอียดชนิดใด", "เครื่องมือวัดแบบขีดสเกลปรับเลื่อนได้", "เครื่องมือวัดแบบขีดสเกลปรับเลื่อนไม่ได้", "เครื่องมือวัดแบบขีดสเกลหมุนได้"],
        ["นักผจญภัยใช้เวอร์เนียคาลิปเปอร์วัดความยาวของแครอทอ่านค่าได้ 60.45 มิลลิเมตร จากข้อความข้างต้น 0.45 คือค่าที่ใดจากการอ่านขีดสเกลใด", "สเกลเลื่อน", "สเกลหมุน", "สเกลหลัก"],
        ["ขีดแต่ละขีดบนสเกลเลื่อนของเวอร์เนียคาร์ลิปเปอร์ขนาด 1/20 มิลลิเมตร 1 ขีดมีค่าเท่าไร", "0.05 มิลลิเมตร", "0.02 มิลลิเมตร", "0.01 มิลลิเมตร"]
    ],
    [
        ["เวลา มีหน่วยฐานตรงกับข้อใด", "วินาที", "นาที", "ชั่วโมง"],
        ["มวล มีหน่วยฐานตรงกับข้อใด", "กิโลกรัม", "นิวตัน", "กรัม"],
        ["ความยาว มีหน่วยฐานตรงกับข้อใด", "เมตร", "เซนติเมตร", "กิโลเมตร"],
        ["อุณหภูมิอุณหพลวัต มีหน่วยฐานตรงกับข้อใด", "เคลวิน", "องศาเซลเซียส", "องศาฟาเรนไฮต์"],
        ["กระเเสไฟฟ้า มีหน่วยฐานตรงกับข้อใด", "แอมแปร์", "วัตต์", "โวลต์"],
        ["ปริมาณสาร มีหน่วยฐานตรงกับข้อใด", "โมล", "กรัม", "กิโลกรัม"],
        ["ความเข้มของการส่องสว่าง มีหน่วยฐานตรงกับข้อใด", "แคนเดลา", "ลูเมน", "ลักซ์"],
        ["นักผจญภัยเดินทางไปยังสวนแครอทเป็นระยะทาง 6 เมตร ใช้เวลา 1 นาที ด้วยความเร็วเฉลี่ย 0.1 เมตรต่อวินาที จากข้อความข้างต้นข้อใดจัดเป็นหน่วยฐาน", "เมตร", "นาที", "เมตรต่อวินาที"],
        ["นักผจญภัยนำมะเขือยาวมวล 0.1 กิโลกรัม มาวัดความยาวได้ 20.05 มิลลิเมตร ใช้เวลา 1 นาที จากข้อความข้างต้นข้อใดจัดเป็นหน่วยฐาน", "กิโลกรัม", "นาที", "มิลลิเมตร"],
        ["นักผจญภัยช่วยชาวบ้านล้างผักโดยใช้น้ำที่อุณหภูมิ 298.15 เคลวิน ละลายเกลือ 15 กรัม และเเช่ทิ้งไว้ 10 นาที จากข้อความข้างต้นข้อใดจัดเป็นหน่วยฐาน", "เคลวิน", "นาที", "กรัม"],
        ["ชาวบ้านนำผักกาดขาวจำนวน 10 ต้น มาใส่กล่องไม้ที่มีขนาดกว้าง 0.6 เมตร ยาว 60 เซนติเมตร และสูง 600 มิลลิเมตร จากข้อความข้างต้นข้อใดจัดเป็นหน่วยฐาน", "เมตร", "เซนติเมตร", "มิลลิเมตร"],
        ["ชาวบ้านช่วยกันออกแรงลากกล่องไม้ที่บรรจุผักกาดขาวมวล 12,000 กรัม ด้วยเเรง 20 นิวตัน เป็นระยะทาง 100 เมตร จากข้อความข้างต้นข้อใดจัดเป็นหน่วยฐาน", "เมตร", "กรัม", "นิวตัน"],
        ["ชาวบ้านนำเศษผักที่เหลือทิ้งมาทำปุ๋ยหมัก โดยใช้น้ำสะอาด 10 ลิตร กากน้ำตาล 1 กิโลกรัม และใช้เวลาในการหมัก 30 วัน จากข้อความข้างต้นข้อใดจัดเป็นหน่วยฐาน", "กิโลกรัม", "ลิตร", "วัน"],
        ["นักผจญภัยวัดกระแสไฟฟ้าที่ใช้ในหลอดไฟ 1 หลอด ได้ 0.125 แอมแปร์ และใช้เวลาติดตั้ง 1 นาที จากข้อความข้างต้นข้อใดจัดเป็นหน่วยฐาน", "แอมแปร์", "หลอด", "นาที"],
        ["ชาวบ้านนำต้นกล้าผักกาดขาวที่ใช้เวลาในการเพาะ 20 วัน ลงแปลงผักที่มีขนาดกว้าง 0.6 เมตร ยาว 300 เซนติเมตร และสูง 200 มิลลิเมตร จากข้อความข้างต้นข้อใดจัดเป็นหน่วยฐาน", "เมตร", "เซนติเมตร", "มิลลิเมตร"],
        ["ชาวบ้านเดินทางไปยังสวนมะเขือเทศเป็นระยะทาง 12 เมตร ใช้เวลา 2 นาที ด้วยความเร็วเฉลี่ย 0.1 เมตรต่อวินาที จากข้อความข้างต้นข้อใดจัดเป็นปริมาณฐาน", "เวลา", "ระยะทาง", "ความเร็วเฉลี่ย"],
        ["ชาวบ้านเดินทางไปยังสวนมะเขือยาวเป็นระยะทาง 10 เมตร เพื่อวัดความยาวและชั่งน้ำหนักของมะเขือยาว จากข้อความข้างต้นข้อใดจัดเป็นปริมาณฐาน", "ความยาว", "ระยะทาง", "น้ำหนัก"],
        ["ชาวบ้านช่วยกันออกแรงลากกล่องไม้ที่บรรจุผักกาดขาวมวล 15 กิโลกรัม ด้วยเเรง 45 นิวตัน เป็นระยะทาง 300 เมตร จากข้อความข้างต้นข้อใดจัดเป็นปริมาณฐาน", "มวล", "ระยะทาง", "แรง"],
        ["ชาวบ้านช่วยกันออกแรงลากกล่องไม้ที่บรรจุผักกาดขาวมวล 15 กิโลกรัม ด้วยเเรง 45 นิวตัน เป็นระยะทาง 300 เมตร จากข้อความข้างต้นข้อใดจัดเป็นปริมาณฐาน", "ความยาว", "ระยะทาง", "การกระจัด"],
        ["วินาที (s) เป็นหน่วยฐานของปริมาณฐานใด", "เวลา", "ปี", "กาลเวลา"],
        ["กิโลกรัม (kg) เป็นหน่วยฐานของปริมาณฐานใด", "มวล", "น้ำหนัก", "ปริมาณสาร"],
        ["เคลวิน (K) เป็นหน่วยฐานของปริมาณฐานใด", "อุณหภูมิอุณหพลวัต", "ความร้อน", "กระเเสไฟฟ้า"],
        ["โมล (mol) เป็นหน่วยฐานของปริมาณฐานใด", "ปริมาณสาร", "ความเข้มข้นของสาร", "น้ำหนักสาร"],
        ["แอมแปร์ (A) เป็นหน่วยฐานของปริมาณฐานใด", "กระเเสไฟฟ้า", "แรงเคลื่อนไฟฟ้า", "ความต้านทานไฟฟ้า"],
        ["แคนเดลา (cd) เป็นหน่วยฐานของปริมาณฐานใด", "ความเข้มของการส่องสว่าง", "อุณหภูมิอุณหพลวัต", "ความเข้มข้นของสาร"]
    ],
    [
        ["คำอุปสรรคที่ใช้แทนตัวพหุคูณ 10⁻¹² ตรงกับข้อใด", "พิโค (pico)", "ไมโคร (micro)", "นาโน (nano)"],
        ["คำอุปสรรคที่ใช้แทนตัวพหุคูณ 10⁻⁹ ตรงกับข้อใด", "นาโน (nano)", "มิลลิ (milli)", "เดซิ (deci)"],
        ["คำอุปสรรคที่ใช้แทนตัวพหุคูณ 10⁻⁶ ตรงกับข้อใด", "ไมโคร (micro)", "นาโน (nano)", "พิโค (pico)"],
        ["คำอุปสรรคที่ใช้แทนตัวพหุคูณ 10⁻² ตรงกับข้อใด", "เซนติ (centi)", "ไมโคร (micro)", "มิลลิ (milli)"],
        ["คำอุปสรรคที่ใช้แทนตัวพหุคูณ 10³ ตรงกับข้อใด", "กิโล (kilo)", " เมกะ (mega)", "จิกะ (giga)"],
        ["คำอุปสรรคที่ใช้แทนตัวพหุคูณ 10⁶ ตรงกับข้อใด", "เมกะ (mega)", "กิโล (kilo)", "พิโค (pico)"],
        ["สัญลักษณ์ของคำอุปสรรคเฮกโต (hecto) ตรงกับข้อใด", "h", "H", "ht"],
        ["สัญลักษณ์ของคำอุปสรรคไมโคร (micro) ตรงกับข้อใด", "μ", "φ", "M"],
        ["นักผจญวัดความยาวของแครอทได้ 2.20 มิลลิเมตร สามารถบันทึกตัวเลขได้ตรงกับข้อใด", "2.20 x 10⁻³ เมตร", "2.2 x 10⁻³ เมตร", "2.20 x 10³ เมตร"],
        ["นักผจญวัดขนาดของมะเขือเทศได้ 0.65 เซนติเมตร สามารถบันทึกตัวเลขได้ตรงกับข้อใด", "6.5 มิลลิเมตร", "6.50 มิลลิเมตร", "6.5 x 10⁻³ เมตร"],
        ["นักผจญภัยวัดกระแสไฟฟ้าที่ไหลผ่านหลอดไฟหลอดหนึ่งได้ 99.56 ไมโครแอมแปร์ สามารถบันทึกค่ากระแสไฟฟ้าที่ไหลผ่านหลอดไฟได้ตรงกับข้อใด", "9.956 x 10⁻⁵ แอมแปร์", "9.956 x 10⁻⁶ แอมแปร์", "9.956 x 10⁻⁷ แอมแปร์"],
        ["นักผจญภัยวัดกระแสไฟฟ้าที่ไหลผ่านหลอดไฟหลอดหนึ่งได้ 9.56 มิลลิแอมแปร์ สามารถบันทึกค่ากระแสไฟฟ้าที่ไหลผ่านหลอดไฟได้ตรงกับข้อใด", "9.56 x 10⁻³ แอมแปร์", "9.6 x 10⁻³ แอมแปร์", "9.56 x 10³ แอมแปร์"],
        ["ชาวบ้านวัดกระแสไฟฟ้าที่ไหลผ่านหลอดไฟได้ 1.45 x 10⁻⁵ กิโลแอมแปร์ สามารถบันทึกค่ากระแสไฟฟ้าที่ไหลผ่านหลอดไฟได้ตรงกับข้อใด", "0.145 ไมโครแอมแปร์", "1.45 ไมโครแอมแปร์", "1.45 x 10⁻⁵ ไมโครแอมแปร์"],
        ["ชาวบ้านวัดขนาดมะเขือยาวได้ 1.64 x 10⁻² เมตร สามารถบันทึกขนาดของมะเขือยาวได้ตรงกับข้อใด ", "1.64 เซนติเมตร", "1.64 มิลลิเมตร", "1.64 เดซิเมตร"],
        ["นักผจญภัยวัดความยาวของผักกาดขาวได้ 20.20 มิลลิเมตร สามารถบันทึกความยาวของผักกาดขาวได้ตรงกับข้อใด", "2.020 เซนติเมตร", "0.2020 เซนติเมตร", "202.0 เซนติเมตร"],
        ["นักผจญภัยวัดความสูงของต้นไม้ได้ 265 เซนติเมตร สามารถบันทึกความสูงของต้นไม้ได้ตรงกับข้อใด", "2.65 เมตร", "2.7 เมตร", "2.6 เมตร"],
        ["นักผจญภัยวัดระยะห่างระหว่างต้นแครอทได้ 23 เซนติเมตร สามารถบันทึกระยะห่างระหว่างต้นแครอทได้ตรงกับข้อใด", "230 มิลลิเมตร", "2.3 มิลลิเมตร", "0.23 มิลลิเมตร"],
        ["ชาวบ้านวัดขนาดเส้นผ่านศูนย์กลางของต้นไม้ได้ 50.45 เซนติเมตร สามารถบันทึกค่าเส้นผ่านศูนย์กลางของต้นไม้ได้ตรงกับข้อใด", "5.045 เดซิเมตร", "5.045 มิลลิเมตร", "5.045 เมตร"],
        ["สัญลักษณ์ของคำอุปสรรคเฟมโต (femto) ตรงกับข้อใด", "f", "F", "fe"],
        ["สัญลักษณ์ของคำอุปสรรคอัตโต (atto) ตรงกับข้อใด", "a", "A", "at"],
        ["สัญลักษณ์ของคำอุปสรรคเพตะ (peta) ตรงกับข้อใด", "P", "p", "pt"],
        ["สัญลักษณ์ของคำอุปสรรคเอกซะ (exa) ตรงกับข้อใด", "E", "e", "ex"],
        ["คำอุปสรรคที่ใช้แทนตัวพหุคูณ 10² ตรงกับข้อใด", "เฮกโต (hecto)", "กิโล (kilo)", "เมกะ (mega)"],
        ["คำอุปสรรคที่ใช้แทนตัวพหุคูณ 10¹⁵ ตรงกับข้อใด", "เพตะ (peta)", "กิโล (kilo)", "เมกะ (mega)"]
    ],
    [
        ["นักผจญภัยวัดขนาดของมะเขือเทศได้ 0.0460 เมตร ค่าที่วัดได้มีเลขนัยสำคัญกี่ตัว", "3 ตัว", "2 ตัว", "4 ตัว"],
        ["นักผจญภัยวัดความยาวของแครอทได้ 20.20 มิลลิเมตร ค่าที่วัดได้มีเลขนัยสำคัญกี่ตัว", "4 ตัว", "2 ตัว", "3 ตัว"],
        ["นักผจญภัยวัดความยาวของมะเขือยาวได้ 7.100 เซนติเมตร ค่าที่วัดได้มีเลขนัยสำคัญกี่ตัว", "4 ตัว", "2 ตัว", "3 ตัว"],
        ["นักผจญภัยวัดขนาดของมะนาวได้ 10.053 เซนติเมตร ค่าที่วัดได้มีเลขนัยสำคัญกี่ตัว", "5 ตัว", "3 ตัว", "4 ตัว"],
        ["นักผจญภัยวัดความยาวของผักกาดขาวได้ 130 มิลลิเมตร ค่าที่วัดได้มีเลขนัยสำคัญกี่ตัว", "3 ตัว", "2 ตัว", "4 ตัว"],
        ["นักผจญภัยชั่งมวลของมะเขือเทศได้ 2.05 กรัม ค่าที่ชั่งได้มีเลขนัยสำคัญกี่ตัว", "3 ตัว", "2 ตัว", "4 ตัว"],
        ["นักผจญภัยชั่งน้ำหนักของแครอทได้ 3.40 x 10² นิวตัน ค่าที่ชั่งได้มีเลขนัยสำคัญกี่ตัว", "3 ตัว", "2 ตัว", "4 ตัว"],
        ["นักผจญภัยชั่งมวลของมะเขือยาวได้ 0.56 กิโลกรัม ค่าที่ชั่งได้มีเลขนัยสำคัญกี่ตัว", "2 ตัว", "3 ตัว", "4 ตัว"],
        ["นักผจญภัยชั่งมวลของมะนาวได้ 0.002 กิโลกรัม ค่าที่ชั่งได้มีเลขนัยสำคัญกี่ตัว", "1 ตัว", "2 ตัว", "3 ตัว"],
        ["นักผจญภัยชั่งมวลของผักกาดขาวได้ 1,500 กรัม ค่าที่ชั่งได้มีเลขนัยสำคัญกี่ตัว", "4 ตัว", "2 ตัว", "3 ตัว"],
        ["นักผจญภัยวัดกระแสไฟฟ้าที่ใช้ในหลอดไฟ 1 หลอดได้ 0.125 แอมแปร์ ค่าที่วัดได้มีเลขนัยสำคัญกี่ตัว", "3 ตัว", "2 ตัว", "4 ตัว"],
        ["นักผจญภัยวัดขนาดพื้นที่ในการสร้างร้านขายผักได้ 1.00 ตารางเมตร ค่าที่วัดได้มีเลขนัยสำคัญกี่ตัว", "3 ตัว", "2 ตัว", "4 ตัว"],
        ["นักผจญภัยวัดอุณหภูมิของหลอดไฟได้ 6.500 x 10³ เคลวิน ค่าที่วัดได้มีเลขนัยสำคัญกี่ตัว", "4 ตัว", "2 ตัว", "3 ตัว"],
        ["ชาวบ้านวัดพื้นที่ในการสร้างแปลงผักได้ 200 ตารางเมตร ค่าที่วัดได้มีเลขนัยสำคัญกี่ตัว", "3 ตัว", "2 ตัว", "1 ตัว"],
        ["ชาวบ้านวัดความกว้างของแปลงปลูกผักแต่ละแปลงได้ 150 เซนติเมตร ค่าที่วัดได้มีเลขนัยสำคัญกี่ตัว", "3 ตัว", "2 ตัว", "1 ตัว"],
        ["ชาวบ้านวัดความยาวของแปลงปลูกผักแต่ละแปลงได้ 0.10 x 10⁻⁴ เซนติเมตร ค่าที่วัดได้มีเลขนัยสำคัญกี่ตัว", "2 ตัว", "3 ตัว", "4 ตัว"],
        ["ชาวบ้านวัดความสูงของแปลงปลูกผักแต่ละแปลงได้ 0.45 เมตร ค่าที่วัดได้มีเลขนัยสำคัญกี่ตัว", "2 ตัว", "3 ตัว", "4 ตัว"],
        ["ชาวบ้านวัดระยะห่างของแปลงปลูกผักแต่ละแปลงได้ 0.50 เมตร ค่าที่วัดได้มีเลขนัยสำคัญกี่ตัว", "2 ตัว", "3 ตัว", "4 ตัว"],
        ["ชาวบ้านวัดระยะทางในการสร้างถนนจากแปลงผักถึงร้านขายผักได้ 0.150 x 10⁻¹ กิโลเมตร ค่าที่วัดได้มีเลขนัยสำคัญกี่ตัว", "3 ตัว", "2 ตัว", "4 ตัว"],
        ["ชาวบ้านวัดระยะทางในการสูบน้ำจากเเม่น้ำถึงแปลงผักได้ 2.500 x 10² เมตร ค่าที่วัดได้มีเลขนัยสำคัญกี่ตัว", "4 ตัว", "3 ตัว", "2 ตัว"],
        ["ชาวบ้านวัดความกว้างของแผ่นไม้เพื่อสร้างโต๊ะขายผักได้ 6.00 x 10⁻¹ เซนติเมตร ค่าที่วัดได้มีเลขนัยสำคัญกี่ตัว", "3 ตัว", "2 ตัว", "1 ตัว"],
        ["ชาวบ้านวัดความยาวของแผ่นไม้เพื่อสร้างโต๊ะขายผักได้ 1.80 x 10⁻² เซนติเมตร ค่าที่วัดได้มีเลขนัยสำคัญกี่ตัว", "3 ตัว", "2 ตัว", "4 ตัว"],
        ["ชาวบ้านวัดความหนาของแผ่นไม้เพื่อสร้างโต๊ะขายผักได้ 0.025 เมตร ค่าที่วัดได้มีเลขนัยสำคัญกี่ตัว", "2 ตัว", "3 ตัว", "4 ตัว"],
        ["ชาวบ้านวัดความสููงของท่อนไม้เพื่อสร้างขาโต๊ะขายผักได้ 750.00 มิลลิเมตร ค่าที่วัดได้มีเลขนัยสำคัญกี่ตัว", "5 ตัว", "4 ตัว", "3 ตัว"],
        ["ชาวบ้านวัดความยาวเส้นรอบวงของท่อนไม้เพื่อสร้างขาโต๊ะขายผักได้ 15.70 เซนติเมตร ค่าที่วัดได้มีเลขนัยสำคัญกี่ตัว", "4 ตัว", "3 ตัว", "2 ตัว"]
    ],
    [
        ["นักผจญภัยเดินไปทางทิศเหนือ 10 เมตร และเดินย้อนกลับไปทางทิศใต้ 15 เมตร จากข้อความข้างต้นเวกเตอร์ลัพธ์มีทิศใด", "ทิศใต้", "ทิศเหนือ", "ทิศตะวันออก"],
        ["นักผจญภัยเดินไปทางทิศใต้ 14.5 เมตร และเดินย้อนกลับไปทางทิศเหนือ 17.5 เมตร จากข้อความข้างต้นเวกเตอร์ลัพธ์มีทิศใด", "ทิศเหนือ", "ทิศใต้", "ทิศตะวันออก"],
        ["นักผจญภัยเดินไปทางทิศตะวันออก 29.5 เมตร และเดินย้อนกลับไปทางทิศตะวันตก 26.5 เมตร จากข้อความข้างต้นเวกเตอร์ลัพธ์มีทิศใด", "ทิศตะวันออก", "ทิศเหนือ", "ทิศตะวันตก"],
        ["นักผจญภัยเดินไปทางทิศตะวันตก 18 เมตร และเดินย้อนกลับไปทางทิศตะวันออก 13.5 เมตร จากข้อความข้างต้นเวกเตอร์ลัพธ์มีทิศใด", "ทิศตะวันตก", "ทิศเหนือ", "ทิศตะวันออก"],
        ["นักผจญภัยเดินไปทางทิศเหนือ 12 เมตร และเดินต่อไปทางทิศตะวันออก 12 เมตร จากข้อความข้างต้นเวกเตอร์ลัพธ์มีทิศใด", "ทิศตะวันออก 45° เหนือ", "ทิศตะวันออก 45° ใต้", "ตะวันตก 45° ใต้"],
        ["นักผจญภัยเดินไปทางทิศตะวันออก 23 เมตร และเดินต่อไปทางทิศเหนือ 23 เมตร จากข้อความข้างต้นเวกเตอร์ลัพธ์มีทิศใด", "ทิศตะวันออก 45° เหนือ", "ทิศตะวันออก 45° ใต้", "ตะวันตก 45° ใต้"],
        ["นักผจญภัยเดินไปทางทิศตะวันตก 30 เมตร และเดินต่อไปทางทิศตะวันตก 30 เมตร จากข้อความข้างต้นเวกเตอร์ลัพธ์มีทิศใด", "ทิศตะวันตก 45° เหนือ", "ทิศตะวันออก 45° ใต้", "ตะวันออก 45° เหนือ"],
        ["นักผจญภัยเดินไปทางทิศตะวันตก 25.5 เมตร และเดินต่อไปทางทิศเหนือ 25.5 เมตร จากข้อความข้างต้นเวกเตอร์ลัพธ์มีทิศใด", "ทิศตะวันตก 45° เหนือ", "ทิศตะวันออก 45° ใต้", "ตะวันออก 45° เหนือ"],
        ["นักผจญภัยเดินไปทางทิศใต้ 17 เมตร และเดินต่อไปทางทิศตะวันตก 17 เมตร จากข้อความข้างต้นเวกเตอร์ลัพธ์มีทิศใด", "ตะวันตก 45° ใต้", "ทิศตะวันออก 45° เหนือ", "ทิศตะวันตก 45° เหนือ"],
        ["นักผจญภัยเดินไปทางทิศตะวันตก 28.5 เมตร และเดินต่อไปทางทิศใต้ 28.5 เมตร จากข้อความข้างต้นเวกเตอร์ลัพธ์มีทิศใด", "ตะวันตก 45° ใต้", "ทิศตะวันออก 45° เหนือ", "ทิศตะวันตก 45° เหนือ"],
        ["นักผจญภัยเดินไปทางทิศตะวันออก 21 เมตร และเดินต่อไปทางทิศใต้ 21 เมตร จากข้อความข้างต้นเวกเตอร์ลัพธ์มีทิศใด", "ทิศตะวันออก 45° ใต้", "ทิศตะวันตก 45° เหนือ", "ตะวันออก 45° เหนือ"],
        ["นักผจญภัยเดินไปทางทิศใต้ 19.5 เมตร และเดินต่อไปทางทิศตะวันออก 19.5 เมตร จากข้อความข้างต้นเวกเตอร์ลัพธ์มีทิศใด", "ทิศตะวันออก 45° ใต้", "ทิศตะวันตก 45° เหนือ", "ตะวันออก 45° เหนือ"],
        ["นักผจญภัยเดินไปทางทิศตะวันออก 12 เมตร เดินต่อไปทางทิศตะวันออก 45° เหนือ 12 เมตร และเดินไปยังทิศตะวันออกอีก 12 เมตร จากข้อความข้างต้นเวกเตอร์ลัพธ์มีทิศใด", "ทิศตะวันออก 19.3° เหนือ", "ทิศตะวันออก 45.0° เหนือ", "ทิศตะวันออก 59.3° เหนือ"],
        ["นักผจญภัยเดินไปทางทิศตะวันตก 40 เมตร เดินต่อไปทางทิศตะวันตก 45° เหนือ 40 เมตร และเดินไปยังทิศตะวันตกอีก 40 เมตร จากข้อความข้างต้นเวกเตอร์ลัพธ์มีทิศใด", "ทิศตะวันตก 19.3° เหนือ", "ทิศตะวันตก 45.0° เหนือ", "ทิศตะวันตก 59.3° เหนือ"],
        ["นักผจญภัยเดินไปทางทิศเหนือ 25 เมตร เดินต่อไปทางทิศตะวันออก 45° เหนือ 25 เมตร และเดินไปยังทิศเหนืออีก 25 เมตร จากข้อความข้างต้นเวกเตอร์ลัพธ์มีทิศใด", "ทิศตะวันตก 19.3° เหนือ", "ทิศตะวันตก 45.0° เหนือ", "ทิศตะวันตก 59.3° เหนือ"],
        ["นักผจญภัยเดินไปทางทิศใต้ 18 เมตร เดินต่อไปทางทิศตะวันออก 45° ใต้ 18 เมตร และเดินไปยังทิศใต้อีก 18 เมตร จากข้อความข้างต้นเวกเตอร์ลัพธ์มีทิศใด", "ทิศตะวันตก 19.3° เหนือ", "ทิศตะวันตก 45.0° เหนือ", "ทิศตะวันตก 59.3° เหนือ"],
        ["นักผจญภัยเดินไปทางทิศตะวันออก 30 เมตร เดินต่อไปทางทิศตะวันออก 45° ใต้ 30 เมตร และเดินไปยังทิศตะวันออกอีก 30 เมตร จากข้อความข้างต้นเวกเตอร์ลัพธ์มีทิศใด", "ทิศตะวันตก 19.3° เหนือ", "ทิศตะวันตก 45.0° เหนือ", "ทิศตะวันตก 59.3° เหนือ"],
        ["นักผจญภัยเดินไปทางทิศตะวันตก 26 เมตร เดินต่อไปทางทิศตะวันตก 45° ใต้ 26 เมตร และเดินไปยังทิศตะวันตกอีก 26 เมตร จากข้อความข้างต้นเวกเตอร์ลัพธ์มีทิศใด", "ทิศตะวันตก 19.3° เหนือ", "ทิศตะวันตก 45.0° เหนือ", "ทิศตะวันตก 59.3° เหนือ"],
        ["กำหนดให้เวกเตอร์ A ขนาด 5 หน่วย มีทิศเหนือ เวกเตอร์ B ขนาด 6 หน่วย มีทิศใต้ และเวกเตอร์ C ขนาด 7 หน่วย มีทิศตะวันออก จากข้อมูลข้างต้นเวกเตอร์ลัพธ์ในข้อใดมีทิศตะวันออกเฉียงใต้", "B + C", "A - C", "A + B"],
        ["กำหนดให้เวกเตอร์ A ขนาด 5 หน่วย มีทิศเหนือ เวกเตอร์ B ขนาด 6 หน่วย มีทิศตะวันตก และเวกเตอร์ C ขนาด 7 หน่วย มีทิศใต้ จากข้อมูลข้างต้นเวกเตอร์ลัพธ์ในข้อใดมีทิศตะวันออกเฉียงเหนือ", "A - B - C", "A - B + C", "A + B - C"],
        ["กำหนดให้เวกเตอร์ A ขนาด 5 หน่วย มีทิศเหนือ เวกเตอร์ B ขนาด 6 หน่วย มีทิศตะวันตก และเวกเตอร์ C ขนาด 7 หน่วย มีทิศใต้ จากข้อมูลข้างต้นเวกเตอร์ลัพธ์ในข้อใดมีทิศตะวันออกเฉียงใต้", "A - B + C", "A - B - C", "A + B -C"],
        ["กำหนดให้เวกเตอร์ A ขนาด 5 หน่วย มีทิศเหนือ เวกเตอร์ B ขนาด 6 หน่วย มีทิศตะวันตก และเวกเตอร์ C ขนาด 7 หน่วย มีทิศใต้ จากข้อมูลข้างต้นเวกเตอร์ลัพธ์ในข้อใดมีทิศตะวันตกเฉียงเหนือ", "A + B - C", "A - B - C", "A - B + C"],
        ["นักผจญภัยเดินไปทางทิศตะวันตก 26 เมตร เดินต่อไปทางทิศตะวันตก 45° ใต้ 26 เมตร และเดินไปยังทิศตะวันตกอีก 26 เมตร หากต้องการเดินกลับมายังจุดเริ่มต้นโดยใช้เวลาน้อยที่สุดเขาจะต้องเดินกลับในทิศใด", "ทิศตะวันตก 19.3° ใต้", "ทิศตะวันตก 45.0° ใต้", "ทิศตะวันตก 59.3° ใต้"],
        ["เวกเตอร์ขนาด 7 หน่วย และ 5 หน่วย หากต้องการเวกเตอร์ลัพธ์ที่มีขนาดน้อยที่สุด จะต้องวางเวกเตอร์ทั้งสองทำมุมกันกี่องศา (°)", "180°", "0°", "90°"],
        ["เวกเตอร์ขนาด 7 หน่วย และ 5 หน่วย หากต้องการเวกเตอร์ลัพธ์ที่มีขนาดมากที่สุด จะต้องวางเวกเตอร์ทั้งสองทำมุมกันกี่องศา (°)", "0°", "90°", "180°"]
    ]
];

function extractQuestionAndAnswers(x, y) {
    var a = data[x][y][0];
    var num = Math.floor(Math.random() * 3);
    var b = data[x][y][1];
    var c = data[x][y][2];
    var d = data[x][y][3];
    if (num == 0) {
        bool = 0;
        textboxValues1 = b;
        textboxValues2 = c;
        textboxValues3 = d;
    } else {
        if (num == 1) {
            bool = 1;
            textboxValues1 = c;
            textboxValues2 = b;
            textboxValues3 = d;
        } else {
            bool = 2;
            textboxValues1 = d;
            textboxValues2 = c;
            textboxValues3 = b;
        }
    }
    Question = a;
}

function extractQuestionAndAnswers2(x, y) {
    var a = data2[x][y][0];
    var b = data2[x][y][1];
    if (b == 1) {
        bool2 = 1;
    } else {
        bool2 = 0;
    }
    Question = a;
}

function showtruefalse() {
    randomtwo();
}

function moveLeavesInToHeart() {
    checktruefalse();
    removeQuestion();
    setTimeout(function() {
        toggleGameContainer2();
    }, 1000);
    if (bool2 == 0) {
        startattacktrue();
    } else {
        startattackfalse();
    }
}

function randomtwo() {
    var a = Math.floor(Math.random() * 5);
    var b = Math.floor(Math.random() * 25);
    extractQuestionAndAnswers2(a, b);
    displayAddedText();
    displayQuestion();
    startTimer(3);
}

function randomthree() {
    var a = Math.floor(Math.random() * 5);
    var b = Math.floor(Math.random() * 25);
    extractQuestionAndAnswers(a, b);
    displayAddedText();
    displayQuestion();
    startTimer(5);
}

function toggleGameContainer2() {
    const gameContainer = document.getElementById('game-container-two');
    const moveTrueButton = document.getElementById('movetrue');
    const moveFalseButton = document.getElementById('movefalse');
    const questionBox = document.getElementById('question-box');
    const isVisible = gameContainer.classList.contains('visible');

    if (isVisible) {
        let opacity = 1;
        let height = 30;
        const interval = 10;
        const steps = 30;
        moveTrueButton.style.display = 'none';
        moveFalseButton.style.display = 'none';
        questionBox.style.display = 'none';
        const decreaseHeight = () => {
            height -= 30 / steps;
            if (height <= 0) {
                height = 0;
                clearInterval(timer);
                gameContainer.style.display = 'none';
                gameContainer.classList.remove('visible');
                gameContainer.classList.add('invisible');

            }
            gameContainer.style.height = height + '%';
        };

        const fadeOut = () => {
            opacity -= 1 / steps;
            if (opacity <= 0) {
                opacity = 0;
                clearInterval(timer);
            }
            gameContainer.style.opacity = opacity;
        };

        const timer = setInterval(() => {
            decreaseHeight();
            fadeOut();
        }, interval);
    } else {
        let opacity = 0;
        let height = 0;
        const interval = 10;
        const steps = 30;

        gameContainer.style.display = 'block';

        const increaseHeight = () => {
            height += 30 / steps;
            if (height >= 30) {
                height = 30;
                clearInterval(timer);
                gameContainer.classList.remove('invisible');
                gameContainer.classList.add('visible');
                questionBox.style.display = 'block';
                moveTrueButton.style.display = 'block';
                moveFalseButton.style.display = 'block';
            }
            gameContainer.style.height = height + '%';
        };

        const fadeIn = () => {
            opacity += 1 / steps;
            if (opacity >= 1) {
                opacity = 1;
                clearInterval(timer);
            }
            gameContainer.style.opacity = opacity;
        };

        const timer = setInterval(() => {
            increaseHeight();
            fadeIn();
        }, interval);
    }
}

function toggleGameContainer() {
    const gameContainer = document.getElementById('game-container');
    const moveLeftButton = document.getElementById('moveleft');
    const moveRightButton = document.getElementById('moveright');
    const questionBox = document.getElementById('question-box');

    const isVisible = gameContainer.classList.contains('visible');

    if (isVisible) {
        let opacity = 1;
        let height = 30;
        const interval = 10;
        const steps = 30;
        moveLeftButton.style.display = 'none';
        moveRightButton.style.display = 'none';
        questionBox.style.display = 'none';
        const decreaseHeight = () => {
            height -= 30 / steps;
            if (height <= 0) {
                height = 0;
                clearInterval(timer);
                gameContainer.style.display = 'none';
                gameContainer.classList.remove('visible');
                gameContainer.classList.add('invisible');

            }
            gameContainer.style.height = height + '%';
        };

        const fadeOut = () => {
            opacity -= 1 / steps;
            if (opacity <= 0) {
                opacity = 0;
                clearInterval(timer);
            }
            gameContainer.style.opacity = opacity;
        };

        const timer = setInterval(() => {
            decreaseHeight();
            fadeOut();
        }, interval);
    } else {
        let opacity = 0;
        let height = 0;
        const interval = 10;
        const steps = 30;

        gameContainer.style.display = 'block';

        const increaseHeight = () => {
            height += 30 / steps;
            if (height >= 30) {
                height = 30;
                clearInterval(timer);
                gameContainer.classList.remove('invisible');
                gameContainer.classList.add('visible');
                moveLeftButton.style.display = 'block';
                moveRightButton.style.display = 'block';
                questionBox.style.display = 'block';
            }
            gameContainer.style.height = height + '%';
        };

        const fadeIn = () => {
            opacity += 1 / steps;
            if (opacity >= 1) {
                opacity = 1;
                clearInterval(timer);
            }
            gameContainer.style.opacity = opacity;
        };

        const timer = setInterval(() => {
            increaseHeight();
            fadeIn();
        }, interval);
    }
}

function moveHeart(state) {
    const heart = document.getElementById('player-heart-true');
    const positions = [
        { top: '50%', left: '65%' },
        { top: '50%', left: '20%' }
    ];

    heart.style.top = positions[state].top;
    heart.style.left = positions[state].left;
    const dx = parseInt(heart.style.left);
    const dy = parseInt(heart.style.top);
    heart.style.transition = 'all 0.5s ease';
    heart.style.transform = `translate(-50%, -50%) translate(${dx}px, ${dy}px)`;
}

function movetrue() {
    count2 = 1;
    moveHeart(count2);
}

function movefalse() {
    count2 = 0;
    moveHeart(count2);
}

function startattacktrue() {
    var healElement = document.getElementById("leavetrue");
    healElement.innerHTML = "";
    for (let i = 0; i < 100; i++) {
        var img = document.createElement("img");
        img.src = "greenleave2.png";
        img.style.left = Math.random() * 150 + "px";
        img.style.top = Math.random() * 150 + "px";
        var duration = Math.random() * 2 - 0.5;
        img.style.animation = "moveleave " + duration + "s linear forwards";
        healElement.appendChild(img);
    }
}

function startattackfalse() {
    var healElement = document.getElementById("leavefalse");
    healElement.innerHTML = "";
    for (let i = 0; i < 100; i++) {
        var img = document.createElement("img");
        img.src = "greenleave2.png";
        img.style.left = Math.random() * 150 + "px";
        img.style.top = Math.random() * 150 + "px";
        var duration = Math.random() * 2 - 0.5;
        img.style.animation = "moveleave " + duration + "s linear forwards";
        healElement.appendChild(img);
    }
}

var timerBar = document.getElementById("timer-bar");
var timer;

function startTimer(totalTime) {
    var remainingTime = totalTime;
    var interval = 10;

    clearInterval(timer);

    timer = setInterval(function() {
        remainingTime -= 0.01;
        var widthPercentage = (remainingTime / totalTime) * 100;
        timerBar.style.width = widthPercentage + "%";
        var greenValue, redValue;
        if (remainingTime >= totalTime * 0.5) {
            greenValue = 255;
            redValue = Math.floor(((totalTime - remainingTime) / (totalTime * 0.5)) * 255);
        } else {
            greenValue = Math.floor((remainingTime / (totalTime * 0.5)) * 255);
            redValue = 255;
        }
        timerBar.style.backgroundColor = "rgb(" + redValue + "," + greenValue + ",0)";

        if (remainingTime <= 0) {
            clearInterval(timer);
            timeup(totalTime);
            setTimeout(refillTimerBar, 1500);
        }
    }, interval);
}

function refillTimerBar() {
    var totalTime = 0.5;
    var remainingTime = 0;
    var interval = 10;

    clearInterval(timer);

    timer = setInterval(function() {
        remainingTime += 0.01;
        var widthPercentage = (remainingTime / totalTime) * 100;
        timerBar.style.width = widthPercentage + "%";
        var greenValue = Math.floor((remainingTime / totalTime) * 255);
        var redValue = 255 - greenValue;
        timerBar.style.backgroundColor = "rgb(" + redValue + "," + greenValue + ",0)";

        if (remainingTime >= totalTime) {
            clearInterval(timer);
            timerBar.style.backgroundColor = "#00ff08";
        }
    }, interval);
}

function timeup(totalTime) {
    if (totalTime == 5) {
        moveArrowIntoHeart();
    } else {
        moveLeavesInToHeart();
    }
}

var playerhealth = 100;
var bosshealth = 100;
document.body.style.overflow = 'hidden';

function initializeHealthBars() {
    updateplayerhealth();
    updatebosshealth();
}

window.onload = initializeHealthBars;

function playerwin() {
    document.getElementById("win-screen").style.display = "flex";
}

function playerlose() {
    document.getElementById("lose-screen").style.display = "flex";
}

function restartGame() {
    document.getElementById("win-screen").style.display = "none";
    document.getElementById("lose-screen").style.display = "none";
    playerhealth = 100;
    bosshealth = 100;
    initializeHealthBars();
}

function playerHealAnimation(n) {
    var increment = 1;
    var healedAmount = 0;
    var intervalTime = 50;
    var interval = setInterval(function() {
        if (healedAmount >= n) {
            clearInterval(interval);
            return;
        }

        if (playerhealth + increment >= 100) {
            playerhealth = 100;
            updateplayerhealth();
            clearInterval(interval);
        } else {
            playerhealth += increment;
            updateplayerhealth();
            healedAmount += increment;
        }

        if (playerhealth === 100) {
            clearInterval(interval);
        }
    }, intervalTime);
}

function bossHealAnimation(n) {
    var increment = 1;
    var healedAmount = 0;
    var intervalTime = 100;
    startheal();
    var interval = setInterval(function() {
        if (healedAmount >= n) {
            clearInterval(interval);
            return;
        }

        if (bosshealth + increment >= 100) {
            bosshealth = 100;
            updatebosshealth();
            clearInterval(interval);
        } else {
            bosshealth += increment;
            updatebosshealth();
            healedAmount += increment;
        }

        if (bosshealth === 100) {
            clearInterval(interval);
        }
    }, intervalTime);
}

function playerdelhealth(n) {
    if (playerhealth <= 0) {
        return;
    }
    playerhealth -= n;
    if (playerhealth < 0) {
        playerhealth = 0;
    }
    updateplayerhealth();
    shakeElement(document.getElementById("player-health-bar"));
}

function bossdelhealth(n) {
    if (bosshealth <= 0) {
        return;
    }
    bosshealth -= n;
    if (bosshealth < 0) {
        bosshealth = 0;
    }
    updatebosshealth();
    shakeElement(document.getElementById("boss-health-bar"));
}


function updatebosshealth() {
    var bossHealthBar = document.getElementById("boss-health-bar");
    var bossHealthText = document.getElementById("boss-health-text");
    var bossHealthFill = document.getElementById("boss-health-fill");
    var bossHealthOverlay = document.getElementById("boss-health-overlay");

    bossHealthFill.style.width = bosshealth + "%";
    bossHealthOverlay.style.width = bosshealth + "%";

    bossHealthText.textContent = bosshealth + "/100";

    if (bosshealth <= 0) {
        playerwin();
    }
}

function updateplayerhealth() {
    var playerHealthBar = document.getElementById("player-health-bar");
    var playerHealthText = document.getElementById("player-health-text");
    var playerHealthFill = document.getElementById("player-health-fill");
    var playerHealthOverlay = document.getElementById("player-health-overlay");

    playerHealthFill.style.width = playerhealth + "%";
    playerHealthOverlay.style.width = playerhealth + "%";

    playerHealthText.textContent = playerhealth + "/100";

    if (playerhealth <= 0) {
        playerlose();
    }
}

function shakeElement(element) {
    element.classList.add('shake-screen');
    setTimeout(function() {
        element.classList.remove('shake-screen');
    }, 200);
}